burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_fmc.h
/*!
    \file    gd32m53x_fmc.h
    \brief   definitions for the FMC

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_FMC_H
#define GD32M53X_FMC_H

#include "gd32m53x.h"

/* FMC and option bytes definition */
#define FMC                        FMC_BASE                       /*!< FMC register base address */
#define OB                         OB_BASE                        /*!< option bytes base address */

/* registers definitions */
#define FMC_WS                     REG32((FMC) + 0x00000000U)     /*!< FMC wait state register */
#define FMC_KEY                    REG32((FMC) + 0x00000004U)     /*!< FMC unlock key register */
#define FMC_OBKEY                  REG32((FMC) + 0x00000008U)     /*!< FMC option bytes unlock key register */
#define FMC_STAT                   REG32((FMC) + 0x0000000CU)     /*!< FMC status register */
#define FMC_CTL                    REG32((FMC) + 0x00000010U)     /*!< FMC control register */
#define FMC_ADDR                   REG32((FMC) + 0x00000014U)     /*!< FMC address register */
#define FMC_DATA                   REG32((FMC) + 0x00000018U)     /*!< FMC program data register */
#define FMC_ECCCS                  REG32((FMC) + 0x00000034U)     /*!< FMC ECC control and status register  */
#define FMC_OBSTAT                 REG32((FMC) + 0x00000038U)     /*!< FMC option bytes status register */
#define FMC_WP                     REG32((FMC) + 0x0000003CU)     /*!< FMC erase/program protection register */
#define FMC_PID0                   REG32((FMC) + 0x00000100U)     /*!< FMC product ID register 0 */
#define FMC_PID1                   REG32((FMC) + 0x00000104U)     /*!< FMC product ID register 1 */

#define OP_BYTE(x)                 REG32((OB) + ((uint32_t)((uint32_t)0x04U * (x))))     /*!< option byte value */
#define OB_SPC_USER                REG32((OB) + 0x00000000U)      /*!< option byte security protection value and user value */
#define OB_DATA                    REG32((OB) + 0x00000004U)      /*!< option byte data value*/
#define OB_WP0                     REG32((OB) + 0x00000008U)      /*!< option bytes write protection value 0 */
#define OB_WP1                     REG32((OB) + 0x0000000CU)      /*!< option bytes write protection value 1 */
#define OB_USER1_WWDGT0            REG32((OB) + 0x00000010U)      /*!< option bytes USER1 and WWDGTT0 */
#define OB_WWDGT1_WWDGT2           REG32((OB) + 0x00000014U)      /*!< option bytes WWDGT1 and WWDGT2 */
#define OB_FWDGT0_FWDGT1           REG32((OB) + 0x00000018U)      /*!< option bytes FWDGT0 and FWDGT1 */
#define OB_FWDGT2_FWDGT3           REG32((OB) + 0x0000001CU)      /*!< option bytes FWDGT2 and FWDGT3 */

/* bits definitions */
/* FMC_WS */
#define FMC_WS_WSCNT               BITS(0,2)                      /*!< wait state counter */
#define FMC_WS_PFEN                BIT(4)                         /*!< pre-fetch enable */
#define FMC_WS_ICEN                BIT(9)                         /*!< IBUS cache enable */
#define FMC_WS_DCEN                BIT(10)                        /*!< DBUS cache enable */
#define FMC_WS_ICRST               BIT(11)                        /*!< IBUS cache reset */
#define FMC_WS_DCRST               BIT(12)                        /*!< DBUS cache reset */

/* FMC_KEY */
#define FMC_KEY_KEY                BITS(0,31)                     /*!< FMC_CTL unlock key0 bits */

/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY            BITS(0,31)                     /*!< option bytes unlock key bits */

/* FMC_STAT */
#define FMC_STAT_BUSY             BIT(0)                         /*!< flash busy flag bit */
#define FMC_STAT_PGSERR           BIT(1)                         /*!< flash program sequence error flag bit */
#define FMC_STAT_PGERR            BIT(2)                         /*!< flash program error flag bit */
#define FMC_STAT_PGAERR           BIT(3)                         /*!< flash program alignment error flag bit */
#define FMC_STAT_WPERR            BIT(4)                         /*!< erase/program protection error flag bit */
#define FMC_STAT_ENDF             BIT(5)                         /*!< end of operation flag bit */
#define FMC_STAT_CBCMDERR         BIT(6)                         /*!< The checked area by the check blank command is all 0xFF or not */

/* FMC_CTL */
#define FMC_CTL_PG                BIT(0)                         /*!< main flash program command bit */
#define FMC_CTL_PER               BIT(1)                         /*!< main flash page erase command bit */
#define FMC_CTL_MER               BIT(2)                         /*!< main flash mass erase command bit */
#define FMC_CTL_OBPG              BIT(4)                         /*!< option bytes program command bit */
#define FMC_CTL_OBER              BIT(5)                         /*!< option bytes erase command bit */
#define FMC_CTL_START             BIT(6)                         /*!< send erase command to FMC bit */
#define FMC_CTL_LK                BIT(7)                         /*!< FMC_CTL lock bit */
#define FMC_CTL_FSTPG             BIT(8)                         /*!< main flash fast program command bit */
#define FMC_CTL_OBWEN             BIT(9)                         /*!< option bytes erase/program enable bit */
#define FMC_CTL_ERRIE             BIT(10)                        /*!< error interrupt enable bit */
#define FMC_CTL_ENDIE             BIT(12)                        /*!< end of operation interrupt enable bit */
#define FMC_CTL_BKSEL             BIT(15)                        /*!< MER/PER/FSTPG for main flash or data flash */
#define FMC_CTL_CBCMD             BIT(16)                        /*!< the command to check the selected area is blank or not */
#define FMC_CTL_OBRLD             BIT(17)                        /*!< reload option byte and generate system reset */
#define FMC_CTL_CBCMDLEN          BITS(29,31)                    /*!< CBCMD read length 2^(CBCMDLEN) */

