burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_fmc.h
/* FMC_ADDR */
#define FMC_ADDR_ADDR             BITS(0,31)                     /*!< flash erase/program command address bits */

/* FMC_DATA */
#define FMC_DATA_DATA             BITS(0,31)                     /*!< flash erase/program command DATA bits */

/* FMC_ECCCS */
#define FMC_ECCCS_ECCCOR           BIT(0)                         /*!< one bit error detected and correct flag */
#define FMC_ECCCS_ECCDET           BIT(1)                         /*!< two bit errors detect flag */
#define FMC_ECCCS_SYS_ECC          BIT(2)                         /*!< system memory flash read ECC error */
#define FMC_ECCCS_MF_ECC           BIT(3)                         /*!< main flash read ECC error */
#define FMC_ECCCS_OTP_ECC          BIT(4)                         /*!< OTP read ECC error */
#define FMC_ECCCS_OB_ECC           BIT(5)                         /*!< OPT read ECC error */
#define FMC_ECCCS_DF_ECC           BIT(6)                         /*!< data flash read ECC error */
#define FMC_ECCCS_SYSECCBK         BIT(7)                         /*!< ECC error in the first 3K or later 3K region of the information block */
#define FMC_ECCCS_ECCDETIE         BIT(14)                        /*!< two bit errors detect interrupt enable */
#define FMC_ECCCS_ECCCORIE         BIT(15)                        /*!< one bit error detected and correct interrupt enable */
#define FMC_ECCCS_ECCADDR          BITS(16,31)                    /*!< ECC error address offset */

/* FMC_OBSTAT */
#define FMC_OBSTAT_OBERR           BIT(0)                         /*!< option bytes read error bit. */
#define FMC_OBSTAT_SPC             BIT(1)                         /*!< option bytes security protection bit */
#define FMC_OBSTAT_USER            BITS(2,9)                      /*!< store USER of option bytes block after system reset */
#define FMC_OBSTAT_DATA            BITS(10,25)                    /*!< store DATA of option bytes block after system reset. */

/* FMC_WP */
#define FMC_WP_WP                  BITS(0,31)                     /*!< store WP of option bytes block after system reset */

/* FMC_PID */
#define FMC_PID0_PID               BITS(0,31)                     /*!< product ID 0 */
#define FMC_PID1_PID               BITS(0,31)                     /*!< product ID 1 */

/* constants definitions */
/* option byte USER*/
typedef struct {
    uint8_t nfwdg_hw;                                             /*!< nFWDG_HW option byte USER */
    uint8_t nrst_dpslp;                                           /*!< nRST_DPSLP of option byte USER */
    uint8_t nrst_stdby;                                           /*!< nRST_STDBY of option byte USER */
    uint8_t lvd0en;                                               /*!< LVD0EN of option byte USER */
    uint8_t fwdgspd_dpslp;                                        /*!< FWDGSPD_DPSLP of option byte USER */
    uint8_t fwdgspd_stdby;                                        /*!< FWDGSPD_STDBY of option byte USER */
    uint8_t lvd0t;                                                /*!< LVD0T of option byte USER */
} optionbyte_user_struct;

/* option byte WWDGT_0*/
typedef struct {
    uint8_t psc;                                                  /*!< PSC of option byte WWDGT0 */
    uint8_t wsps;                                                 /*!< WSPS of option byte WWDGT0 */
    uint8_t weps;                                                 /*!< WEPS of option byte WWDGT0 */
    uint8_t ewie;                                                 /*!< EWIE of option byte WWDGT0 */
    uint8_t wdga;                                                 /*!< WDGA of option byte WWDGT0 */
} optionbyte_wwdgt0_struct;

/* fmc state enumeration */
typedef enum {
    FMC_READY = 0U,                                               /*!< the operation has been completed */
    FMC_BUSY,                                                     /*!< the operation is in progress */
    FMC_PGSERR,                                                   /*!< program sequence error */
    FMC_PGERR,                                                    /*!< program error */
    FMC_PGAERR,                                                   /*!< program alignment error */
    FMC_WPERR,                                                    /*!< erase/program protection error */
    FMC_TOERR,                                                    /*!< timeout error */
    FMC_CBCMDERR,                                                 /*!< the checked area not blank error */
    FMC_OB_HSPC                                                   /*!< high security protection */
} fmc_state_enum;

/* FMC erase/program protection enumeration */
typedef enum {
    OB_WP_NONE = ((uint32_t)0x00000000U),                         /*!< disable all erase/program protection */
    OB_WP_0    = ((uint32_t)0x00000001U),                         /*!< erase/program protection of main flash page 0 ~ 7 */
    OB_WP_1    = ((uint32_t)0x00000002U),                         /*!< erase/program protection of main flash page 8 ~ 15 */
    OB_WP_2    = ((uint32_t)0x00000004U),                         /*!< erase/program protection of main flash page 16 ~23 */
    OB_WP_3    = ((uint32_t)0x00000008U),                         /*!< erase/program protection of main flash page 24 ~ 31 */
    OB_WP_4    = ((uint32_t)0x00000010U),                         /*!< erase/program protection of main flash page 32 ~ 39 */
    OB_WP_5    = ((uint32_t)0x00000020U),                         /*!< erase/program protection of main flash page 40 ~ 47 */
    OB_WP_6    = ((uint32_t)0x00000040U),                         /*!< erase/program protection of main flash page 48 ~ 55 */
    OB_WP_7    = ((uint32_t)0x00000080U),                         /*!< erase/program protection of main flash page 56 ~ 63 */
    OB_WP_8    = ((uint32_t)0x00000100U),                         /*!< erase/program protection of main flash page 64 ~ 71 */
    OB_WP_9    = ((uint32_t)0x00000200U),                         /*!< erase/program protection of main flash page 72 ~ 79 */
    OB_WP_10   = ((uint32_t)0x00000400U),                         /*!< erase/program protection of main flash page 80 ~ 87 */
    OB_WP_11   = ((uint32_t)0x00000800U),                         /*!< erase/program protection of main flash page 88 ~ 95 */
    OB_WP_12   = ((uint32_t)0x00001000U),                         /*!< erase/program protection of main flash page 96 ~ 103 */
    OB_WP_13   = ((uint32_t)0x00002000U),                         /*!< erase/program protection of main flash page 104 ~ 111 */
    OB_WP_14   = ((uint32_t)0x00004000U),                         /*!< erase/program protection of main flash page 112 ~ 119 */
    OB_WP_15   = ((uint32_t)0x00008000U),                         /*!< erase/program protection of main flash page 120 ~ 127 */
    OB_WP_16   = ((uint32_t)0x00010000U),                         /*!< erase/program protection of main flash page 128 ~ 135 */
    OB_WP_17   = ((uint32_t)0x00020000U),                         /*!< erase/program protection of main flash page 136 ~ 143 */
    OB_WP_18   = ((uint32_t)0x00040000U),                         /*!< erase/program protection of main flash page 144 ~ 151 */
    OB_WP_19   = ((uint32_t)0x00080000U),                         /*!< erase/program protection of main flash page 152 ~ 159 */
    OB_WP_20   = ((uint32_t)0x00100000U),                         /*!< erase/program protection of main flash page 160 ~ 167 */
    OB_WP_21   = ((uint32_t)0x00200000U),                         /*!< erase/program protection of main flash page 168 ~ 175 */
    OB_WP_22   = ((uint32_t)0x00400000U),                         /*!< erase/program protection of main flash page 176 ~ 183 */
    OB_WP_23   = ((uint32_t)0x00800000U),                         /*!< erase/program protection of main flash page 184 ~ 256 */
    OB_WP_24   = ((uint32_t)0x01000000U),                         /*!< erase/program protection of data flash page 0 ~ 7 */
    OB_WP_25   = ((uint32_t)0x02000000U),                         /*!< erase/program protection of data flash page 8 ~ 15 */
    OB_WP_26   = ((uint32_t)0x04000000U),                         /*!< erase/program protection of data flash page 16 ~23 */
    OB_WP_27   = ((uint32_t)0x08000000U),                         /*!< erase/program protection of data flash page 24 ~ 31 */
    OB_WP_28   = ((uint32_t)0x10000000U),                         /*!< erase/program protection of data flash page 32 ~ 39 */
    OB_WP_29   = ((uint32_t)0x20000000U),                         /*!< erase/program protection of data flash page 40 ~ 47 */
    OB_WP_30   = ((uint32_t)0x40000000U),                         /*!< erase/program protection of data flash page 48 ~ 55 */
    OB_WP_31   = ((uint32_t)0x80000000U),                         /*!< erase/program protection of data flash page 56 ~ 63 */
    OB_WP_ALL = ((uint32_t)0xFFFFFFFFU)                           /*!< erase/program protection of all pages */
} fmc_ob_wp_enum;

/* define the FMC bit position and its register index offset */
#define FMC_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define FMC_REG_VAL(offset)             (REG32(FMC + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define FMC_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)
#define FMC_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                             | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define FMC_REG_VAL2(offset)            (REG32(FMC + ((uint32_t)(offset) >> 22)))
#define FMC_BIT_POS2(val)               (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define FMC_STAT_REG_OFFSET            ((uint32_t)0x0000000CU)                  /*!< STAT0 register offset */
#define FMC_CTL_REG_OFFSET             ((uint32_t)0x00000010U)                  /*!< CTL0 register offset */
#define FMC_ECCCS_REG_OFFSET           ((uint32_t)0x00000034U)                  /*!< ECCCS register offset */
#define FMC_OBSTAT_REG_OFFSET          ((uint32_t)0x00000038U)                  /*!< OBSTAT register offset */

/* FMC flags */
typedef enum {
    /* flags in STAT register */
    FMC_FLAG_BUSY = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 0U),                    /*!< flash busy flag */
    FMC_FLAG_PGSERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 1U),                  /*!< flash program sequence error flag */
    FMC_FLAG_PGERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 2U),                   /*!< flash program error flag */
    FMC_FLAG_PGAERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 3U),                  /*!< flash program alignment error flag */
    FMC_FLAG_WPERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 4U),                   /*!< flash erase/program protection error flag */
    FMC_FLAG_END = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 5U),                     /*!< flash end of operation flag */
    FMC_FLAG_CBCMDERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 6U),                /*!< flash checked area by the check blank command is all 0xFF or not flag */
    /* flags in ECCCS register */
    FMC_FLAG_ECCCOR = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 0U),                 /*!< single bit ECC error flag */
    FMC_FLAG_ECCDET = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 1U),                 /*!< double bit ECC error flag */
    FMC_FLAG_SYSECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 2U),                 /*!< system memory flash read ECC error flag */
    FMC_FLAG_MFECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 3U),                  /*!< main flash read ECC error flag */
    FMC_FLAG_OTPECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 4U),                 /*!< OTP read ECC error flag */
    FMC_FLAG_OBECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 5U),                  /*!< OPT read ECC error flag */
    FMC_FLAG_DFECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 6U),                  /*!< data flash read ECC error status */
    FMC_FLAG_SYSECCBK = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 7U),               /*!<  ECC error in the first 3K or later 3K region of the information block */
    /* flags in OBSTAT register */
    FMC_FLAG_OBERR = FMC_REGIDX_BIT(FMC_OBSTAT_REG_OFFSET, 0U)                  /*!< option bytes read error flag */
} fmc_flag_enum;

