burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_fmc.h
/* FMC interrupt flags */
typedef enum {
    /* interrupt flags in STAT0 register */
    FMC_INT_FLAG_PGSERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 10U, FMC_STAT_REG_OFFSET, 1U),        /*!< flash program sequence error interrupt flag */
    FMC_INT_FLAG_PGERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 10U, FMC_STAT_REG_OFFSET, 2U),         /*!< flash program error interrupt flag */
    FMC_INT_FLAG_PGAERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 10U, FMC_STAT_REG_OFFSET, 3U),        /*!< flash program alignment error interrupt flag */
    FMC_INT_FLAG_WPERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 10U, FMC_STAT_REG_OFFSET, 4U),         /*!< flash erase/program protection error interrupt flag */
    FMC_INT_FLAG_END = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 12U, FMC_STAT_REG_OFFSET, 5U),           /*!< flash end of operation interrupt flag */
    FMC_INT_FLAG_CBCMDERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 10U, FMC_STAT_REG_OFFSET, 6U),      /*!< flash checked area by the check blank command is all 0xFF or not interrupt flag */
    /* interrupt flags in ECCCS register */
    FMC_INT_FLAG_ECCCOR = FMC_REGIDX_BIT2(FMC_ECCCS_REG_OFFSET, 15U, FMC_ECCCS_REG_OFFSET, 0U),     /*!< single bit ECC error interrupt flag */
    FMC_INT_FLAG_ECCDET = FMC_REGIDX_BIT2(FMC_ECCCS_REG_OFFSET, 14U, FMC_ECCCS_REG_OFFSET, 1U)      /*!< double bit ECC error interrupt flag */
} fmc_interrupt_flag_enum;

/* FMC interrupt */
typedef enum {
    /* interrupt in CTL0 register */
    FMC_INT_ERR = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 10U),                       /*!< FMC flash error interrupt */
    FMC_INT_END = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 12U),                       /*!< FMC flash end of operation interrupt */
    /* interrupt in ECCCS register */
    FMC_INT_ECCDET = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 14U),                  /*!< FMC double ECC error interrupt */
    FMC_INT_ECCCOR = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 15U)                   /*!< FMC single ECC error interrupt */
} fmc_interrupt_enum;

/* unlock key */
#define UNLOCK_KEY0                ((uint32_t)0x45670123U)        /*!< unlock key 0 */
#define UNLOCK_KEY1                ((uint32_t)0xCDEF89ABU)        /*!< unlock key 1 */

/* FMC wait state counter */
#define WS_WSCNT(regval)           (BITS(0,2) & ((uint32_t)(regval)))
#define FMC_WAIT_STATE_0           WS_WSCNT(0)                    /*!< FMC 0 wait state */
#define FMC_WAIT_STATE_1           WS_WSCNT(1)                    /*!< FMC 1 wait state */
#define FMC_WAIT_STATE_2           WS_WSCNT(2)                    /*!< FMC 2 wait state */
#define FMC_WAIT_STATE_3           WS_WSCNT(3)                    /*!< FMC 3 wait state */
#define FMC_WAIT_STATE_4           WS_WSCNT(4)                    /*!< FMC 4 wait state */
#define FMC_WAIT_STATE_5           WS_WSCNT(5)                    /*!< FMC 5 wait state */
#define FMC_WAIT_STATE_6           WS_WSCNT(6)                    /*!< FMC 6 wait state */

/* read protect configure */
#define FMC_NSPC                   ((uint8_t)0xA5U)               /*!< no security protection */
#define FMC_LSPC                   ((uint8_t)0xBBU)               /*!< low security protection */
#define FMC_HSPC                   ((uint8_t)0xCCU)               /*!< high security protection */

/* option bytes software/hardware free watch dog timer */
#define OB_FWDGT_HW                ((uint8_t)0x00U)               /*!< hardware free watchdog */
#define OB_FWDGT_SW                ((uint8_t)0x01U)               /*!< software free watchdog */

/* option bytes reset or not entering deep-sleep mode */
#define OB_DEEPSLEEP_RST           ((uint8_t)0x00U)               /*!< generate a reset instead of entering deepsleep mode */
#define OB_DEEPSLEEP_NRST          ((uint8_t)0x02U)               /*!< no reset when entering deepsleep mode */

/* option bytes reset or not entering standby mode */
#define OB_STDBY_RST               ((uint8_t)0x00U)               /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST              ((uint8_t)0x04U)               /*!< no reset when entering standby mode */

/* option bytes voltage monitoring 0 enabled or not after a reset */
#define OB_LVDOEN_ENABLE           ((uint8_t)0x00U)               /*!< voltage monitoring 0 reset is enabled after a reset */
#define OB_LVDOEN_DISABLE          ((uint8_t)0x08U)               /*!< voltage monitoring 0 reset is disabled after a reset */

/* option bytes fwdgt deepsleep */
#define OB_FWDGDPSLP_ENABLE        ((uint8_t)0x00U)               /*!< fwdgt deepsleep */
#define OB_FWDGDPSLP_DISABLE       ((uint8_t)0x10U)               /*!< fwdgt deepsleep */

/* option bytes fwdgt standby */
#define OB_FWDGSTANDBY_ENABLE      ((uint8_t)0x00U)               /*!< fwdgt standby */
#define OB_FWDGSTANDBY_DISABLE     ((uint8_t)0x20U)               /*!< fwdgt standby */

/* option bytes lvd0t value */
#define OB_LVD0T_VALUE2            ((uint8_t)0x80U)               /*!< 2.90V/2.82V(raising/falling) */
#define OB_LVD0T_VALUE3            ((uint8_t)0xC0U)               /*!< 4.31V/4.23V(raising/falling) */

/* option bytes software/hardware window watchdog timer */
#define OB_WWDGT_HW                ((uint8_t)0x00U)               /*!< hardware window watchdog */
#define OB_WWDGT_SW                ((uint8_t)0x01U)               /*!< software window watchdog */

/* option bytes sram ecc check */
#define OB_SRAMECC_DISABLE         ((uint8_t)0x00U)               /*!< sram ecc disable */
#define OB_SRAMECC_ENABLE          ((uint8_t)0x02U)               /*!< sram ecc ensable */

/* option bytes SWD */
#define OB_SWD_DISABLE             ((uint8_t)0x00U)               /*!< swd mode disable */
#define OB_SWD_ENABLE              ((uint8_t)0x04U)               /*!< swd mode ensable */

/* option bytes nrst mode */
#define OB_NRST_MODE_VALUE1        ((uint8_t)0x00U)               /*!< nrst mode = 1 */
#define OB_NRST_MODE_VALUE2        ((uint8_t)0x40U)               /*!< nrst mode = 2 */
#define OB_NRST_MODE_VALUE3        ((uint8_t)0xC0U)               /*!< nrst mode = 3 */

/* option bytes prescaler for WWDG counter clock from option byte */
#define OB_WWDG_PSC8               ((uint8_t)0x00U)               /*!< (PCLK1 / 4096) / 8 */
#define OB_WWDG_PSC4               ((uint8_t)0x01U)               /*!< (PCLK1 / 4096) / 4 */
#define OB_WWDG_PSC2               ((uint8_t)0x02U)               /*!< (PCLK1 / 4096) / 2 */
#define OB_WWDG_PSC1               ((uint8_t)0x03U)               /*!< (PCLK1 / 4096) / 1 */

/* option bytes wwdg window start position */
#define OB_WSPS_VALUE25            ((uint8_t)0x00U)               /*!< WWDG window start position 25 */
#define OB_WSPS_VALUE50            ((uint8_t)0x04U)               /*!< WWDG window start position 50 */
#define OB_WSPS_VALUE75            ((uint8_t)0x08U)               /*!< WWDG window start position 75 */
#define OB_WSPS_VALUE100           ((uint8_t)0x0CU)               /*!< WWDG window start position 100 */

/* option bytes wwdg window end position */
#define OB_WEPS_VALUE75            ((uint8_t)0x00U)               /*!< WWDG window end position 75 */
#define OB_WEPS_VALUE50            ((uint8_t)0x10U)               /*!< WWDG window end position 50 */
#define OB_WEPS_VALUE25            ((uint8_t)0x20U)               /*!< WWDG window end position 25 */
#define OB_WEPS_VALUE0             ((uint8_t)0x30U)               /*!< WWDG window end position 0 */

/* option bytes early wakeup interrupt */
#define OB_EWIE_ENABLE             ((uint8_t)0x00U)               /*!< early wakeup interrupt disable */
#define OB_EWIE_DISABLE            ((uint8_t)0x40U)               /*!< early wakeup interrupt enable */

/* option bytes wwdgt to generate a reset */
#define OB_WWDGT_RST_DISABLE       ((uint8_t)0x00U)               /*!< disable wwdgt to generate a reset */
#define OB_WWDGT_RST_ENABLE        ((uint8_t)0x80U)               /*!< enable wwdgt to generate a reset */

/* option bytes enable fwdgt to generate a reset */
#define OB_FWDGT_RST_DISABLE       ((uint8_t)0x00U)               /*!< disable fwdgt to generate a reset */
#define OB_FWDGT_RST_ENABLE        ((uint8_t)0x80U)               /*!< enable fwdgt to generate a reset */

/* option bytes free watchdog timer prescaler selection */
#define OB_FWDGT_PSC4              ((uint8_t)0x00U)               /*!< free watchdog timer prescaler selection 1/4 */
#define OB_FWDGT_PSC8              ((uint8_t)0x10U)               /*!< free watchdog timer prescaler selection 1/8 */
#define OB_FWDGT_PSC16             ((uint8_t)0x20U)               /*!< free watchdog timer prescaler selection 1/16 */
#define OB_FWDGT_PSC32             ((uint8_t)0x30U)               /*!< free watchdog timer prescaler selection 1/32 */
#define OB_FWDGT_PSC64             ((uint8_t)0x40U)               /*!< free watchdog timer prescaler selection 1/64 */
#define OB_FWDGT_PSC128            ((uint8_t)0x50U)               /*!< free watchdog timer prescaler selection 1/128 */
#define OB_FWDGT_PSC256            ((uint8_t)0x60U)               /*!< free watchdog timer prescaler selection 1/256 */

#define MFLASH_BASE_ADDRESS        ((uint32_t)0x08000000U)        /*!< FMC main flash base address */
#define MFLASH_SIZE                ((uint32_t)0x00040000U)        /*!< FMC main flash size */
#define DFLASH_BASE_ADDRESS        ((uint32_t)(0x08800000U)       /*!< FMC data flash base address */
#define DFLASH_SIZE                ((uint32_t)0x00010000U)        /*!< FMC data flash size */
#define FMC_TIMEOUT_COUNT          ((uint32_t)0x0FF00000U)        /*!< count to judge of FMC timeout 0x00100000U*/
#define DOUBLEWORD_CNT_IN_ROW      ((uint8_t)0x20U)               /*!< main flash double-word count in one row data */
#define DOUBLEWORD_DATA_CNT_IN_ROW ((uint8_t)0x08U)               /*!< data flash double-word count in one row data */
#define CBCMDLEN_OF_ONE_ROW_MAIN   ((uint8_t)0x04U)               /*!< main flash CBCMD read length of one row data */
#define CBCMDLEN_OF_ONE_ROW_DATA   ((uint8_t)0x02U)               /*!< data flash CBCMD read length of one row data */

