burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_fmc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check address */
#define NOT_FMC_VALID_ADDRESS(address)                            (((address) < 0x08000000U) || (((address) < 0x08800000U) && ((address) > 0x0803FFFFU)) || \
                                                                   ((address) > 0x0880FFFFU))
/* check check blank address configuration */
#define NOT_FMC_VALID_BLANK_ADDRESS_CONFIG(address, length)       ((((address)%0x400U) + ((2U << ((length) + 3U)))) > 0x400U)
/* check interface 0 address */
#define NOT_FMC_VALID_OTP_ADDRESS(address)                        (((address) < 0x1FFF7000U) || ((address) > 0x1FFF71FFU))
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* unlock the main flash and data flash operation */
void fmc_unlock(void);
/* lock the main flash and data flash operation */
void fmc_lock(void);
/* set the wait state counter value */
void fmc_wscnt_set(uint32_t wscnt);
/* enable pre-fetch */
void fmc_prefetch_enable(void);
/* disable pre-fetch */
void fmc_prefetch_disable(void);
/* enable IBUS cache */
void fmc_ibus_enable(void);
/* disable IBUS cache */
void fmc_ibus_disable(void);
/* enable DBUS cache */
void fmc_dbus_enable(void);
/* disable DBUS cache */
void fmc_dbus_disable(void);
/* reset IBUS cache enable */
void fmc_ibus_reset_enable(void);
/* reset IBUS cache disable */
void fmc_ibus_reset_disable(void);
/* reset DBUS cache enable*/
void fmc_dbus_reset_enable(void);
/* reset DBUS cache disable */
void fmc_dbus_reset_disable(void);
/* check whether flash page is blank or not by check blank command */
fmc_state_enum fmc_blank_check(uint32_t address, uint8_t length);
/* erase main flash or data flash page */
fmc_state_enum fmc_page_erase(uint32_t page_address);
/* erase main flash */
fmc_state_enum fmc_mflash_mass_erase(void);
/* erase data flash */
fmc_state_enum fmc_dflash_mass_erase(void);
/* erase whole chip */
fmc_state_enum fmc_mass_erase(void);
/* FMC program four words at the corresponding address */
fmc_state_enum fmc_fourword_program(uint32_t address, uint64_t data_l, uint64_t data_h);
/* FMC fast program one row data starting at the corresponding address */
fmc_state_enum fmc_fast_program(uint32_t address, uint64_t data[]);
/* FMC program four words at the corresponding address in otp */
fmc_state_enum fmc_otp_fourword_program(uint32_t address, uint64_t data_l, uint64_t data_h);

/* FMC option bytes programming functions */
/* unlock the option bytes operation */
void ob_unlock(void);
/* lock the option bytes operation */
void ob_lock(void);
/* reload the option byte and generate a system reset */
void ob_reset(void);
/* erase the option bytes */
fmc_state_enum ob_erase(void);
/* enable write protect */
fmc_state_enum ob_write_protection_enable(fmc_ob_wp_enum ob_wp);
/* configure the option bytes security protection */
fmc_state_enum ob_security_protection_config(uint8_t ob_spc);
/* write the FMC option bytes */
fmc_state_enum ob_user_write(optionbyte_user_struct *optionbyte_user);
/* program option bytes data */
fmc_state_enum ob_data_program(uint16_t ob_data);
/* write the FMC option bytes USER1 */
fmc_state_enum ob_user1_write(uint8_t ob_wwdg_hw, uint8_t ob_sram_ecc, uint8_t ob_swd_mode, uint8_t ob_nrst_mod);
/* write the FMC option bytes WWDGT0 */
fmc_state_enum ob_wwdgt0_write(optionbyte_wwdgt0_struct *optionbyte_wwdg0);
/* write the FMC option bytes WWDGT1 and WWDGT2 */
fmc_state_enum ob_wwdgt1_wwdgt2_write(uint16_t ob_wwdg_cnt);
/* write the FMC option bytes FWDGT0 and FWDGT1 and FWDGT2 and FWDGT3 */
fmc_state_enum ob_fwdgt_write(uint16_t ob_fwdgt_wnd, uint8_t ob_fwdgt_psc, uint8_t ob_fwdgt_rst,
                              uint16_t ob_fwdgt_reload);
/* get the FMC option bytes user */
uint8_t ob_user_get(void);
/* get OB_DATA in register FMC_OBSTAT */
uint16_t ob_data_get(void);
/* get the FMC option bytes write protection */
uint32_t ob_write_protection_get(void);
/* get option bytes security protection state */
FlagStatus ob_security_protection_flag_get(void);
/* get ecc error address */
uint16_t fmc_ecc_error_address_get(void);

/* FMC interrupts and flags management functions */
/* check flag is set or not */
FlagStatus fmc_flag_get(fmc_flag_enum flag);
/* clear the FMC flag */
void fmc_flag_clear(fmc_flag_enum flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(fmc_interrupt_enum interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(fmc_interrupt_enum interrupt);
/* get FMC interrupt flag state */
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum int_flag);
/* clear FMC interrupt flag state */
void fmc_interrupt_flag_clear(fmc_interrupt_flag_enum int_flag);

#endif /* GD32M53X_FMC_H */
